//##################################################################################
//纪录所有用户的用户名和密码
//##################################################################################


//###############################################################################################################################
//总数组，包括了所有的User/pwd
//总数组，包括了所有的User/pwd
//基本格式：Users[usersIndex]=new Array("","");usersIndex++;//Users[x][0]是name,Users[x][1]是password


var Users=new Array();

var usersIndex=0;//用作累积数，为了后面方便

Users[usersIndex]=new Array("xiaobo","xiaobo");usersIndex++;

Users[usersIndex]=new Array("hello","hello");usersIndex++;

//###############################################################################################################################
//相关操作函数
//###############################################################################################################################


//检查是否有此用户,密码是否正确
function checkUser(usname,uspwd){
	for(var i=0;i<Users.length;i++){
		if(Users[i][0]==usname && Users[i][1]==uspwd){
			return true;
		}
	}
	return false;
}